<?php

return [
    'singular' => 'المنتج الفرعي',
    'plural' => 'المنتجات فرعية',
    'empty' => 'لا يوجد منتجات فرعية.',
    'count' => 'عدد المنتجات فرعية',
    'search' => 'بحث',
    'select' => 'اختر المنتج الفرعي',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منتج الفرعي',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منتج الفرعي',
        'show' => 'عرض المنتج الفرعي',
        'edit' => 'تعديل المنتج الفرعي',
        'delete' => 'حذف المنتج الفرعي',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المنتج الفرعي بنجاح.',
        'updated' => 'تم تعديل المنتج الفرعي بنجاح.',
        'deleted' => 'تم حذف المنتج الفرعي بنجاح.',
        'cant-delete' => 'لا يمكنك حذف هذه المنتج الفرعي لانها مستخدمة لدي بعض المغاسل.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى المنتج الفرعي الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم المنتج الفرعي',
        'image' => 'صورة المنتج الفرعي',
        'description' => 'الوصف',
        'quantity' => 'الكمية',
        'old_price' => 'السعر القديم',
        'is_recommended' => 'توصية',
        'price' => 'السعر',
        'total' => 'المجموع',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنتج الفرعي ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
