<?php

return [
    'singular' => 'المنتج',
    'plural' => 'المنتجات',
    'empty' => 'لا يوجد منتجات.',
    'count' => 'عدد المنتجات',
    'search' => 'بحث',
    'select' => 'اختر المنتج',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن منتج',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة منتج',
        'show' => 'عرض المنتج',
        'edit' => 'تعديل المنتج',
        'delete' => 'حذف المنتج',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
    ],
    'messages' => [
        'created' => 'تم اضافة المنتج بنجاح.',
        'updated' => 'تم تعديل المنتج بنجاح.',
        'deleted' => 'تم حذف المنتج بنجاح.',
        'cant-delete' => 'لا يمكنك حذف هذه المنتج لانها لوجود بيانات مرتبطة بها.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لمنتج الملف: 10 ميجا بايت',
    ],
    'attributes' => [
        'name' => 'اسم المنتج',
        'image' => 'صورة المنتج',
        'description' => 'الوصف',
        'quantity' => 'الكمية',
        'old_price' => 'السعر القديم',
        'is_recommended' => 'توصية',
        'price' => 'السعر',
        'price_with_offer' => 'السعر (سعر العرض :price) ',
        'total' => 'المجموع',
        'cover' => 'الغلاف',
        'images' => 'الصور',
        'material' => 'المواد المستخدمة',
        'made_in' => 'صنع في',
        "vendor" => 'التاجر',
        "recommended" => 'موصي به '
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف المنتج ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],
];
