<?php

return [
    'pending' => [
        'user' => [
            'subject' => 'شكراً لطلبك.',
            'body' => 'طلبك قيد الانتظار، يرجى الانتظار حتى يتم مراجعة الطلب من قبل المتجر'
        ],
        'worker' => [
            'subject' => 'لديك طلب جديد.',
            'body' => 'لديك طلب جديد #:id متاح'
        ],
    ],


    'accepted' => [
        'user' => [
            'subject' => 'تم قبول طلبك #:id.',
            'body' => 'تم قبول طلبك #:id، يرجى الانتظار حتى يتم تعيين سائق التوصيل.'
        ],
        'delivery' => [
            'subject' => 'لديك طلب جديد.',
            'body' => 'لديك طلب جديد #:id متاح'
        ],
    ],


    'onwayToClient' => [
        'user' => [
            'subject' => 'تم تعيين سائق توصيل لطلبك #:id.',
            'body' => 'تم تعيين سائق توصيل لطلبك #:id، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
        'worker' => [
            'subject' => 'تم قبول الطلب #:id من قبل سائق التوصيل.',
            'body' => 'الطلب #:id في طريقه إلى العميل'
        ],
    ],


    'pickedFromClient' => [
        'user' => [
            'subject' => 'تم استلام الطلب #:id من قبل سائق التوصيل.',
            'body' => 'تم استلام الطلب #:id من قبل سائق التوصيل، وهو في طريقه إلى المتجر.'
        ],
        'worker' => [
            'subject' => 'تم استلام الطلب #:id من قبل سائق التوصيل.',
            'body' => 'الطلب #:id في طريقه إلى العميل، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
        'delivery' => [
            'subject' => 'تم اتمام الطلب #:id.',
            'body' => 'تم اضافة مبلغ #:amount الي محفظتك'
        ],


    ],


    'deliveredToLaundry' => [
        'user' => [
            'subject' => 'تم تسليم الطلب #:id إلى المتجر بواسطة سائق التوصيل.',
            'body' => 'تم تسليم الطلب #:id إلى المتجر بواسطة سائق التوصيل، وهو مدرج للغسيل.'
        ],
        'worker' => [
            'subject' => 'تم تسليم الطلب #:id إلى المتجر بواسطة سائق التوصيل.',
            'body' => 'تم تسليم الطلب #:id إلى المتجر بواسطة سائق التوصيل، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
    ],


    'inProgress' => [
        'user' => [
            'subject' => 'الطلب #:id قيد الغسيل.',
            'body' => 'الطلب #:id قيد الغسيل من قبل المتجر.'
        ]
    ],


    'finishWashing' => [
        'user' => [
            'subject' => 'الطلب #:id قيد الغسيل.',
            'body' => 'الطلب #:id قيد الغسيل من قبل المتجر.'
        ],
        'delivery' => [
            'subject' => 'لديك طلب جديد.',
            'body' => 'لديك طلب جديد #:id متاح.'
        ],
    ],


    'onwayToLaundry' => [
        'user' => [
            'subject' => 'تم تعيين سائق توصيل لطلبك #:id.',
            'body' => 'تم تعيين سائق توصيل لطلبك #:id'
        ],
        'worker' => [
            'subject' => 'تم قبول الطلب #:id من قبل سائق التوصيل.',
            'body' => 'الطلب #:id في طريقه إلى العميل، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
    ],


    'pickedFromLaundry' => [
        'user' => [
            'subject' => 'تم استلام الطلب #:id من قبل سائق التوصيل.',
            'body' => 'تم استلام الطلب #:id من قبل سائق التوصيل، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
        'worker' => [
            'subject' => 'تم استلام الطلب #:id من قبل سائق التوصيل.',
            'body' => 'الطلب #:id في طريقه إلى العميل'
        ],
    ],


    'deliveredToClient' => [
        'user' => [
            'subject' => 'تم تسليم الطلب #:id إلى العميل بواسطة سائق التوصيل.',
            'body' => 'تم تسليم الطلب #:id إلى العميل بواسطة سائق التوصيل، وهو مدرج للتسليم.'
        ],
        'worker' => [
            'subject' => 'تم تسليم الطلب #:id إلى العميل بواسطة سائق التوصيل.',
            'body' => 'تم تسليم الطلب #:id إلى العميل بواسطة سائق التوصيل، يرجى الانتظار حتى يصل سائق التوصيل إلى موقعك.'
        ],
    ],


    'deliveredByClient' => [
        'user' => [
            'subject' => 'لقد حجزت الطلب #:id.',
            'body' => 'لقد حجزت الطلب #:id.'
        ],
        'worker' => [
            'subject' => 'تم حجز الطلب #:id من قبل العميل.',
            'body' => 'تم حجز الطلب #:id من قبل العميل.'
        ],
    ],

    'refund' => [
        'user' => [
            'true' => [
                'subject' => 'لقد تم ارسال طلب الاسترداد الخاص بالطلب #:id.',
                'body' => 'لقد تم الاسترداد بنجاح'
            ],
            'false' => [
                'subject' => 'لقد تم ارسال طلب الاسترداد الخاص بالطلب #:id.',
                'body' => 'يرجي مراجعة الدعم لاستكمال الاسترداد بنجاح'
            ]

        ]
    ],


    'cancelled' => [
        'subject' => 'تم إلغاء طلبك',
        'body' => 'تم إلغاء الطلب #:id من قبل المتجر',
        'body_reason' => 'تم إلغاء الطلب #:id من قبل المتجر بسبب :reason',
        'system_body' => 'تم إلغاء الطلب #:id لأنه تجاوز الوقت المسموح به لقبول الطلب أو تعيين سائق التوصيل من قبل المتجر.',
        'reasons' => [
            'vendor has been deleted from application' => 'تم حذف المتجر من التطبيق',
            'vendor has been blocked from application' => 'تم حظر المتجر من التطبيق',
            'service has been deleted from this vendor' => 'تم حذف الخدمة من هذه المتجر',
        ]
    ],


    'user-types' => [
        'user' => 'العميل',
        'delivery' => 'سائق التوصيل',
        'worker' => 'عامل المتجر',
        'admin' => 'مدير النظام',
        'other' => 'غير ذلك'
    ]
];
