<?php

return [
    'singular' => 'القسم',
    'plural' => 'الأقسام',
    'empty' => 'لا يوجد أقسام.',
    'count' => 'عدد الأقسام',
    'search' => 'بحث',
    'select' => 'اختر القسم',
    'perPage' => 'عدد النتائج بالصفحة',
    'filter' => 'ابحث عن قسم',
    'actions' => [
        'list' => 'عرض الكل',
        'create' => 'اضافة قسم',
        'show' => 'عرض القسم',
        'edit' => 'تعديل القسم',
        'delete' => 'حذف القسم',
        'options' => 'خيارات',
        'save' => 'حفظ',
        'filter' => 'بحث',
        'order' => 'ترتيب الأقسام',
        'save_order' => 'حفظ الترتيب',
        'cancel' => 'إلغاء',
    ],
    'messages' => [
        'created' => 'تم اضافة القسم بنجاح.',
        'updated' => 'تم تعديل القسم بنجاح.',
        'ordered' => 'تم ترتيب الأقسام بنجاح.',
        'deleted' => 'تم حذف القسم بنجاح.',
        'images_note' => 'الملفات المدعومة: jpeg ، png ، jpg | الحد الأقصى لحجم الملف: 10 ميجا بايت',
        'drag_info' => 'اسحب الصفوف لإعادة ترتيب الفئات. سيتم حفظ الترتيب عند النقر على زر حفظ الترتيب.',
        'drag_drop_title' => 'اسحب وأفلت لإعادة ترتيب الفئات',
        'ordered' => 'تم ترتيب الفئات بنجاح!',
        'select_category' => 'اختر الفئة',

    ],
    'attributes' => [
        'name' => 'اسم القسم',
        'type' => 'النوع',
        'link' => 'لينك القسم',
        'image' => 'صورة القسم',
        'handle' => 'المقبض',
        'project' => 'مشروع',
        'product' => 'منتج',
    ],
    'dialogs' => [
        'delete' => [
            'title' => 'تحذير !',
            'info' => 'هل انت متأكد انك تريد حذف القسم ؟',
            'confirm' => 'حذف',
            'cancel' => 'الغاء',
        ],
    ],

];
